# recommender.py

class Recommender:
    """
    감정과 사용자 선택에 따라 콘텐츠를 추천하는 클래스입니다.
    """
    def __init__(self):
        self.recommendation_db = {
            '기쁨': {
                '수용': ["영화: 월터의 상상은 현실이 된다", "음악: Pharrell Williams - Happy", "책: 창문 넘어 도망친 100세 노인"],
                '전환': ["영화: 쇼생크 탈출", "음악: 이루마 - River Flows In You"]
            },
            '행복': {
                '수용': ["영화: 비긴 어게인", "음악: 쿨 - All for You", "책: 꾸뻬씨의 행복여행"],
                '전환': ["영화: 포레스트 검프", "음악: 토이 - 좋은 사람"]
            },
            '불안': {
                '수용': ["영화: 인사이드 아웃", "음악: 위로가 되는 연주곡 플레이리스트", "책: 미움받을 용기"],
                '전환': ["영화: 극한직업", "음악: Maroon 5 - Moves Like Jagger"]
            },
            '분노': {
                '수용': ["영화: 존 윅", "음악: 람슈타인 - Du Hast"],
                '전환': ["영화: 리틀 포레스트", "음악: 노라 존스 - Don't Know Why"]
            },
            '슬픔': {
                '수용': ["영화: 이터널 선샤인", "음악: 박효신 - 눈의 꽃", "책: 1리터의 눈물"],
                '전환': ["영화: 월-E", "음악: 거북이 - 비행기"]
            },
            '상처': {
                '수용': ["영화: 캐스트 어웨이", "음악: 김광석 - 서른 즈음에", "책: 죽고 싶지만 떡볶이는 먹고 싶어"],
                '전환': ["영화: 글러브 (승패를 떠난 야구의 순수한 열정과 감동을 느껴보세요)", "음악: 옥상달빛 - 수고했어, 오늘도"]
            },
            
        }

    def recommend(self, emotion: str, choice: str) -> list:
        return self.recommendation_db.get(emotion, {}).get(choice, ["😥 아쉽지만, 아직 준비된 추천이 없어요."])